<p><font size="6"><b>03 - Pandas: Indexing and selecting data - part I</b></font></p>


> *Data wrangling in Python*  
> *November, 2020*
>
> *Â© 2020, Joris Van den Bossche and Stijn Van Hoey  (<mailto:jorisvandenbossche@gmail.com>, <mailto:stijnvanhoey@gmail.com>). Licensed under [CC BY 4.0 Creative Commons](http://creativecommons.org/licenses/by/4.0/)*

---

In [1]:
import pandas as pd

In [2]:
# redefining the example DataFrame

data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

# Subsetting data

## Subset variables (columns)

For a DataFrame, basic indexing selects the columns (cfr. the dictionaries of pure python)

Selecting a **single column**:

In [3]:
countries['area'] # single []

0     30510
1    671308
2    357050
3     41526
4    244820
Name: area, dtype: int64

In [4]:
countries

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

In [5]:
columns_to_select = ["area", "population"]

In [8]:
type(columns_to_select)

list

In [9]:
countries[columns_to_select]

     area  population
0   30510        11.3
1  671308        64.3
2  357050        81.3
3   41526        16.9
4  244820        64.9

In [10]:
countries[["area", "population"]]

     area  population
0   30510        11.3
1  671308        64.3
2  357050        81.3
3   41526        16.9
4  244820        64.9

Remember that the same syntax can also be used to *add* a new columns: `df['new'] = ...`.

We can also select **multiple columns** by passing a list of column names into `[]`:

In [ ]:
countries[['area', 'population']] # double [[]]

## Subset observations (rows)

Using `[]`, slicing or boolean indexing accesses the **rows**:

### Slicing

In [ ]:
countries[0:4]

In [13]:
my_list = [1, 2, 3, 4, 5, 6, 7]

In [ ]:
my_list[start:stop:step]

In [14]:
my_list[1:6:2]

[2, 4, 6]

In [16]:
countries[0:3]

   country  population    area   capital
0  Belgium        11.3   30510  Brussels
1   France        64.3  671308     Paris
2  Germany        81.3  357050    Berlin

### Boolean indexing (filtering)

Often, you want to select rows based on a certain condition. This can be done with *'boolean indexing'* (like a where clause in SQL) and comparable to numpy. 

The indexer (or boolean mask) should be 1-dimensional and the same length as the thing being indexed.

In [20]:
mask = countries['area'] > 100000
mask

0    False
1     True
2     True
3    False
4     True
Name: area, dtype: bool

In [21]:
countries[mask]

          country  population    area capital
1          France        64.3  671308   Paris
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

In [22]:
countries[countries['area'] > 100000]

          country  population    area capital
1          France        64.3  671308   Paris
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

In [ ]:
countries[countries['area'] > 100000]

In [ ]:
countries[countries['population'] > 50]

An overview of the possible comparison operations:

Operator   |  Description
------ | --------
==       | Equal
!=       | Not equal
\>       | Greater than
\>=       | Greater than or equal
\<       | Lesser than
<=       | Lesser than or equal

and to combine multiple conditions:

Operator   |  Description
------ | --------
&       | And (`cond1 & cond2`)
\|       | Or (`cond1 \| cond2`)

<div class="alert alert-info" style="font-size:120%">
<b>REMEMBER</b>: <br><br>

So as a summary, `[]` provides the following convenience shortcuts:

* **Series**: selecting a **label**: `s[label]`
* **DataFrame**: selecting a single or multiple **columns**:`df['col']` or `df[['col1', 'col2']]`
* **DataFrame**: slicing or filtering the **rows**: `df['row_label1':'row_label2']` or `df[mask]`

</div>

## Some other useful methods: `isin` and `string` methods

The `isin` method of Series is very useful to select rows that may contain certain values:

In [23]:
countries["area"] > 100000

0    False
1     True
2     True
3    False
4     True
Name: area, dtype: bool

In [24]:
s = countries['capital']

In [27]:
(countries['capital'] == "Berlin") | (countries['capital'] == "London")

0    False
1    False
2     True
3    False
4     True
Name: capital, dtype: bool

In [25]:
s

0     Brussels
1        Paris
2       Berlin
3    Amsterdam
4       London
Name: capital, dtype: object

In [ ]:
s.isin()

In [28]:
s.isin(['Berlin', 'London'])

0    False
1    False
2     True
3    False
4     True
Name: capital, dtype: bool

This can then be used to filter the dataframe with boolean indexing:

In [29]:
countries[countries['capital'].isin(['Berlin', 'London'])]

          country  population    area capital
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

Let's say we want to select all data for which the capital starts with a 'B'. In Python, when having a string, we could use the `startswith` method:

In [30]:
string = 'Berlin'

False

In [ ]:
string.startswith('B')

In pandas, these are available on a Series through the `str` namespace:

In [36]:
countries['capital'].str.startswith("B")

0     True
1    False
2     True
3    False
4    False
Name: capital, dtype: bool

In [ ]:
countries['capital'].str.startswith('B')

For an overview of all string methods, see: https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

# Exercises using the Titanic dataset

In [37]:
df = pd.read_csv("data/titanic.csv")

In [38]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select all rows for male passengers and calculate the mean age of those passengers. Do the same for the female passengers.</li>
</ul>
</div>

In [44]:
subset_males = df[df["Sex"] == "male"]

In [45]:
subset_males['Age'].mean()

30.72664459161148

In [47]:
subset_females = df[df["Sex"] == "female"]

In [48]:
subset_females['Age'].mean()

27.915708812260537

In [ ]:
# %load _solutions/pandas_03a_selecting_data1.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data2.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data3.py

We will later see an easier way to calculate both averages at the same time with groupby.

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many passengers older than 70 were on the Titanic?</li>
</ul>
</div>

In [50]:
subset = df[df["Age"] > 70]

In [51]:
len(subset)

5

In [53]:
subset.shape[0]

5

In [55]:
(df["Age"] > 70).sum()

5

In [ ]:
# %load _solutions/pandas_03a_selecting_data4.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data5.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select the passengers that are between 30 and 40 years old?</li>
</ul>
</div>

In [60]:
df[(df['Age'] > 30) & (df['Age'] < 40)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [ ]:
# %load _solutions/pandas_03a_selecting_data6.py

<div class="alert alert-success">

<b>EXERCISE</b>:

Split the 'Name' column on the `,` extract the first part (the surname), and add this as new column 'Surname'.

* Get the first value of the 'Name' column.
* Split this string (check the `split()` method of a string) and get the first element of the resulting list.
* Write the previous step as a function, and 'apply' this function to each element of the 'Name' column (check the `apply()` method of a Series).

</div>

In [81]:
pd.Series.str.split?

Signature: pd.Series.str.split(self, pat=None, n=-1, expand=False)
Docstring:
Split strings around given separator/delimiter.

Splits the string in the Series/Index from the beginning,
at the specified delimiter string. Equivalent to :meth:`str.split`.

Parameters
----------
pat : str, optional
    String or regular expression to split on.
    If not specified, split on whitespace.
n : int, default -1 (all)
    Limit number of splits in output.
    ``None``, 0 and -1 will be interpreted as return all splits.
expand : bool, default False
    Expand the split strings into separate columns.

    * If ``True``, return DataFrame/MultiIndex expanding dimensionality.
    * If ``False``, return Series/Index, containing lists of strings.

Returns
-------
Series, Index, DataFrame or MultiIndex
    Type matches caller unless ``expand=True`` (see Notes).

See Also
--------
Series.str.split : Split strings around given separator/delimiter.
Series.str.rsplit : Splits string around given separator/delimiter,
    starting from the right.
Series.str.join : Join lists contained as elements in the Series/Index
    with passed delimiter.
str.split : Standard library version for split.
str.rsplit : Standard library version for rsplit.

Notes
-----
The handling of the `n` keyword depends on the number of found splits:

- If found splits > `n`,  make first `n` splits only
- If found splits <= `n`, make all splits
- If for a certain row the number of found splits < `n`,
  append `None` for padding up to `n` if ``expand=True``

If using ``expand=True``, Series and Index callers return DataFrame and
MultiIndex objects, respectively.

Examples
--------
>>> s = pd.Series(
...     [
...         "this is a regular sentence",
...         "https://docs.python.org/3/tutorial/index.html",
...         np.nan
...     ]
... )
>>> s
0                       this is a regular sentence
1    https://docs.python.org/3/tutorial/index.html
2                                              NaN
dtype: object

In the default setting, the string is split by whitespace.

>>> s.str.split()
0                   [this, is, a, regular, sentence]
1    [https://docs.python.org/3/tutorial/index.html]
2                                                NaN
dtype: object

Without the `n` parameter, the outputs of `rsplit` and `split`
are identical.

>>> s.str.rsplit()
0                   [this, is, a, regular, sentence]
1    [https://docs.python.org/3/tutorial/index.html]
2                                                NaN
dtype: object

The `n` parameter can be used to limit the number of splits on the
delimiter. The outputs of `split` and `rsplit` are different.

>>> s.str.split(n=2)
0                     [this, is, a regular sentence]
1    [https://docs.python.org/3/tutorial/index.html]
2                                                NaN
dtype: object

>>> s.str.rsplit(n=2)
0                     [this is a, regular, sentence]
1    [https://docs.python.org/3/tutorial/index.html]
2                                                NaN
dtype: object

The `pat` parameter can be used to split by other characters.

>>> s.str.split(pat="/")
0                         [this is a regular sentence]
1    [https:, , docs.python.org, 3, tutorial, index...
2                                                  NaN
dtype: object

When using ``expand=True``, the split elements will expand out into
separate columns. If NaN is present, it is propagated throughout
the columns during the split.

>>> s.str.split(expand=True)
                                               0     1     2        3         4
0                                           this    is     a  regular  sentence
1  https://docs.python.org/3/tutorial/index.html  None  None     None      None
2                                            NaN   NaN   NaN      NaN       NaN

For slightly more complex use cases like splitting the html document name
from a url, a combination of parameter settings can be used.

>>> s.str.rsplit("/", n=1, expand=True)
                                    0           1
0          this is a regular sentence        None
1  https://docs.python.org/3/tutorial  index.html
2                                 NaN         NaN

Remember to escape special characters when explicitly using regular
expressions.

>>> s = pd.Series(["1+1=2"])
>>> s
0    1+1=2
dtype: object
>>> s.str.split(r"\+|=", expand=True)
     0    1    2
0    1    1    2
File:      ~/miniconda3/envs/FLAMES-python/lib/python3.8/site-packages/pandas/core/strings.py
Type:      function

In [61]:
df['Name'].head(3)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [64]:
df['Surname'] = df['Name'].str.split(",").str.get(0)

In [65]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen

In [66]:
names = df['Name']

In [69]:
name = names[0]

In [70]:
name

'Braund, Mr. Owen Harris'

In [72]:
name.split(",")[0]

'Braund'

In [74]:
def extract_surname(name):
    return name.split(",")[0]

In [75]:
df["Name"].apply(extract_surname)

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [76]:
df["Name"].apply(lambda name: name.split(",")[0])

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [ ]:
extract_surname

In [ ]:
# %load _solutions/pandas_03a_selecting_data7.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data8.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data9.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data10.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data11.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data12.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data13.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data14.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select all passenger that have a surname starting with 'Williams'.</li>
</ul>
</div>

In [78]:
df[df["Surname"].str.startswith("Williams")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,Williams
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C,Williams
304,305,0,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,Williams
351,352,0,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S,Williams-Lambert
735,736,0,3,"Williams, Mr. Leslie",male,28.5,0,0,54636,16.1000,NaN,S,Williams

In [ ]:
# %load _solutions/pandas_03a_selecting_data15.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select all rows for the passengers with a surname of more than 15 characters.</li>
</ul>
    
</div>

In [80]:
# %load _solutions/pandas_03a_selecting_data16.py
df[df['Surname'].str.len() > 15]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C,Penasco y Castellana
351,352,0,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S,Williams-Lambert
430,431,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0,0,0,110564,26.5500,C52,S,Bjornstrom-Steffansson
444,445,1,3,"Johannesen-Bratthammer, Mr. Bernt",male,NaN,0,0,65306,8.1125,NaN,S,Johannesen-Bratthammer
505,506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.0,1,0,PC 17758,108.9000,C65,C,Penasco y Castellana
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.2000,B41,C,Frolicher-Stehli
632,633,1,1,"Stahelin-Maeglin, Dr. Max",male,32.0,0,0,13214,30.5000,B50,C,Stahelin-Maeglin

# [OPTIONAL] more exercises

For the quick ones among you, here are some more exercises with some larger dataframe with film data. These exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that. You can download these data from here: [`titles.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKajNMa1pfSzN6Q3M) and [`cast.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKal9UYTJSR2ZhSW8) and put them in the `/notebooks/data` folder.

In [ ]:
cast = pd.read_csv('data/cast.csv')
cast.head()

In [ ]:
titles = pd.read_csv('data/titles.csv')
titles.head()

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many movies are listed in the titles dataframe?</li>
</ul>
    
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data17.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>What are the earliest two films listed in the titles dataframe?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data18.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many movies have the title "Hamlet"?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data19.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>List all of the "Treasure Island" movies from earliest to most recent.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data20.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many movies were made from 1950 through 1959?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data21.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data22.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many roles in the movie "Inception" are NOT ranked by an "n" value?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data23.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data24.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data25.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>But how many roles in the movie "Inception" did receive an "n" value?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data26.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Display the cast of the "Titanic" (the most famous 1997 one) in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data27.py

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>List the supporting roles (having n=2) played by Brad Pitt in the 1990s, in order by year.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data28.py

# Acknowledgement


> The optional exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that.

---